<template>
    <el-input>
    </el-input>
</template>
<script>
    module.exports ={
        props:["id"],
        data(){
            return{
                编号类型数组:["简单数字","章节编号"],
                数字编号样式对象数组:[
                                {"样式名":"简单数字","示例":"01,02,03,04"},
                                {"样式名":"零开头的简单数字","示例":"01,02,03,04"},
                                {"样式名":"中文小写","示例":"一,二,三,四"},
                                ],
                编号项目内容设定对象:{
                                    "h1":{"前缀":"","值样式":"","后缀":""},
                                    "h2":{"前缀":"","值样式":"","后缀":""},
                                    "h3":{"前缀":"","值样式":"","后缀":""},
                                    "h4":{"前缀":"","值样式":"","后缀":""},
                                    "h5":{"前缀":"","值样式":"","后缀":""},
                                    "h6":{"前缀":"","值样式":"","后缀":""},
                                    "内容":{"前缀":"","值样式":"","后缀":""},
                                    },
            }
        },
        methods:{
            计数器构建器(){
                
            },
            构建对象树(){

            },
            计算对象编号值(对象,上级对象){
                
            },
        }
        
    }

</script>
<style>
</style>